/* eslint-disable no-cyrillic-string/no-cyrillic-string */
export const langvars = {
  test: {
    languageVariable: 'Hello, {0}!',
    test: 'Test!',
  },

  codeCountries: {
    ru: 'Россия',
    ua: 'Украина',
  },

  countries: {
    ru: 'Россия и СНГ',
    ua: 'Украина',
    eu: 'Евросоюз',
    us: 'США',
    ot: 'Другие страны',
  },

  currencies: {
    title: 'Валюта',
    usd: 'Доллар США',
    rub: 'Российский рубль',
    eur: 'Евро',
  },

  paymentSystems: {
    title: 'Цель вывода',
    visa: 'VISA',
    mc: 'MasterCard',
    mir: 'МИР',
  },

  plural: {
    order: {
      first: 'заказ',
      second: 'заказа',
      third: 'заказов',
    },

    hour: {
      first: 'час',
      second: 'часа',
      third: 'часов',
    },

    day: {
      first: 'день',
      second: 'дня',
      third: 'дней',
    },
  },

  header: {
    categories: 'Категории',
    search: 'Найти магазин c кэшбеком',
    enter: 'Вход',
    logOut: 'Выйти',
    register: 'Регистрация',
    navigation: {
      shops: 'Магазины',
      promos: 'Промокоды',
      blog: 'Блог',
      help: 'Помощь',
    },
  },

  footer: {
    allShops: 'Все магазины',
    about: 'О компании',
    smiAbout: 'СМИ о нас',
    contacts: 'Контакты',
    faq: 'Вопросы и ответы',
    support: 'Поддержка',
    cooperation: 'Сотрудничество',
    aroundTheClock: 'круглосуточно',
    payment: 'Способы вывода средств',
    ltd: '© KORTING LTD, ',
    privacy: 'Политика конфиденциальности',
    terms: 'Пользовательское соглашение',
    cookie: 'Политика использования cookie',
    download: 'Скачайте мобильное приложение',
    socials: 'Мы в соцсетях',
  },

  breadcrumbs: {
    main: 'Скидка.ру',
    lk: 'Личный кабинет',
    register: 'Регистрация',
    login: 'Вход',
    shops: 'Магазины',
    promos: 'Промокоды',
  },

  pagination: {
    next: 'следующая',
    prev: 'предыдущая',
  },

  register: {
    heading: 'Регистрация',
    email: 'Почта',
    phone: 'Телефон',
    inputEmail: 'Введите почту',
    inputPassword: 'Введите пароль',
    repeatPassword: 'Повторите пароль',
    inputPhone: 'Введите номер телефона',
    next: 'Далее',
    agreement: 'Я принимаю пользовательское соглашение и политику конфиденциальности',
    onRegister: 'Зарегистрироваться',
    login: 'Войти',
    check: 'Если есть аккаунт',
    socialRegister: 'или зарегистрируйся через социальные сети',
  },

  login: {
    title: 'Вход',
    firstTime: 'Ты у нас впервые?',
    register: 'Зарегистрируй аккаунт',
  },

  homePage: {
    favorites: 'Избранные магазины',
    cacheBack: 'Кэшбэк до ',
    allShops: 'Все магазины',
    saleShops: 'Акционные магазины',
    popularShops: 'Популярные магазины',
    conditions: 'Условия недели',
    allConditions: 'Все условия',
    promos: 'Промокоды',
    toPromos: 'К промокоду',
    allPromos: 'Все промокоды',
    validTo: 'осталось {0} {1}',
    categories: 'Категории',
    stayWithUs: 'Оставайтесь с нами',
    download: 'Скачивай приложение',
    downloadDesc: 'В любое время. Быстро и невероятно удобно!',
    social: 'Добавляйся к нам в соц. сети',
    descriptionHeading: 'Кэшбэк сервис СКИДКА РУ',
    showIsFull: 'Показать полностью',
    showIsNotFull: 'Скрыть',
    articles: 'Статьи',
  },
  changeCountry: {
    title: 'Укажите страну доставки',
    description:
      'Выбор страны необходим для отображения магазинов, осуществляющих доставку в страну покупателя.',
    complete: 'Подтвердить',
    attention:
      'Если Вы неверно выбрали страну доставки, то кэшбэк может быть аннулирован или начислен с пониженной ставкой. Изменить страну доставки Вы можете в личном кабинете.',
  },

  shops: {
    heading: 'Все магазины c кэшбэком',
    placeholder: 'Найти магазин c кэшбеком',
    searchBtn: 'Искать магазин',
    categories: 'Все категории',
    sort: 'По популярности',
    favorites: 'Избранное',
    promos: 'Промокоды',
  },

  promos: {
    heading: 'Магазины с промокодами',
    placeholder: 'Найти магазин c кэшбеком',
    searchBtn: 'Искать магазин',
    categories: 'Все категории',
    sort: 'По популярности',
    favorites: 'Избранное',
    promos: 'Промокоды',
    act: 'Действует до',
    goShop: 'Перейти в магазин',
  },

  lk: {
    pages: {
      wallet: 'Мой счет',
      history: 'История',
      withdrawal: 'Вывод средств',
      favoriteStores: 'Любимые магазины',
      settings: 'Настройка профиля',
      support: 'Поддержка',
      exit: 'Выход',
    },

    wallet: {
      econom: 'Съэкономлено за все время:',
      withdrawal: 'Выведено за всё время:',
      myWallet: 'Мой Счет',
      available: 'Доступно',
      pending: 'В ожидании',
      output: 'Вывести',
      pendingText:
        'Обычно средства начисляются в течении 14 банковских дней. Если этого не случилось, обратитесь в ',
      support: 'службу поддержки',
      attentionHeading: 'Пожалуйста, обрати внимание',
      attention1:
        'Иностранные магазины и сервисы, например, AliExpress и Booking.com, начисляют вознаграждение, из которого выплачивается кэшбэк, в валюте, вследствие этого в статусе «В ожидании» твой кэшбэк отображается в валюте.',

      attention2:
        'В день, когда магазины перечисляют вознаграждение СКИДКА РУ, вознаграждение автоматически конвертируется в российские рубли по актуальному курсу ЦБ РФ и твой кэшбэк становится доступным к выводу.',

      attention31: 'Если у тебя остались вопросы,',
      attention32: 'создай заявку',
      attention33: ' в службу поддержки. Mы с удовольствием на них ответим.',
    },

    withdrawal: {
      card: 'Номер карты',

      visa: {
        text1: 'В редких случаях это время может достигать до 3 банковских дней.',
        text2: 'Комиссия: 1.00$ + 10%',
        text3: 'Сумма к выводу от 1.00$ до 15 000$',
      },

      name: 'Имя Фамилия (как на карте)',
      available: 'Доступно для вывода:',
      sum: 'Сумма вывода',
      commission: 'Комиссия за перевод:',
      total: 'Итого к выводу:',
      next: 'Далее',
      tooltip: 'Перевод произойдет по курсу на: ',
    },
  },
};
